/*
  Simple DirectMedia Layer
  Copyright (C) 1997-2014 Sam Lantinga <slouken@libsdl.org>

  This software is provided 'as-is', without any express or implied
  warranty.  In no event will the authors be held liable for any damages
  arising from the use of this software.

  Permission is granted to anyone to use this software for any purpose,
  including commercial applications, and to alter it and redistribute it
  freely, subject to the following restrictions:

  1. The origin of this software must not be misrepresented; you must not
     claim that you wrote the original software. If you use this software
     in a product, an acknowledgment in the product documentation would be
     appreciated but is not required.
  2. Altered source versions must be plainly marked as such, and must not be
     misrepresented as being the original software.
  3. This notice may not be removed or altered from any source distribution.
*/

#ifndef _SDL_CONFIG_H
#define _SDL_CONFIG_H

#ifndef _SDL_platform_h
#define _SDL_platform_h

#if defined(_AIX)
#undef __AIX__
#define __AIX__     1
#endif
#if defined(__HAIKU__)
#undef __HAIKU__
#define __HAIKU__   1
#endif
#if defined(bsdi) || defined(__bsdi) || defined(__bsdi__)
#undef __BSDI__
#define __BSDI__    1
#endif
#if defined(_arch_dreamcast)
#undef __DREAMCAST__
#define __DREAMCAST__   1
#endif
#if defined(__FreeBSD__) || defined(__FreeBSD_kernel__) || defined(__DragonFly__)
#undef __FREEBSD__
#define __FREEBSD__ 1
#endif

#define _SDL_config_minimal_h

#define HAVE_STDARG_H   1
#define HAVE_STDDEF_H   1

#if defined(_MSC_VER) && (_MSC_VER < 1600)

typedef unsigned int size_t;
typedef signed char int8_t;
typedef unsigned char uint8_t;
typedef signed short int16_t;
typedef unsigned short uint16_t;
typedef signed int int32_t;
typedef unsigned int uint32_t;
typedef signed long long int64_t;
typedef unsigned long long uint64_t;
typedef unsigned long uintptr_t;
#else
#define HAVE_STDINT_H 1
#endif

#ifdef __GNUC__
#define HAVE_GCC_SYNC_LOCK_TEST_AND_SET 1
#endif

#define SDL_AUDIO_DRIVER_DUMMY  1

#define SDL_JOYSTICK_DISABLED   1

#define SDL_HAPTIC_DISABLED 1

#define SDL_LOADSO_DISABLED 1

#define SDL_THREADS_DISABLED    1

#define SDL_TIMERS_DISABLED 1

#define SDL_VIDEO_DRIVER_DUMMY  1

#define SDL_FILESYSTEM_DUMMY  1

#endif

#endif

#ifdef DECLSPEC
#undef DECLSPEC
#endif
#define DECLSPEC

#if (defined(_MSC_VER) && !defined(WINAPI_FAMILY))
//#pragma warning(disable:4002)
//#pragma warning(disable:4003)
//#pragma warning(disable:4018)
//#pragma warning(disable:4244)
#pragma once
#endif

#define SDL_INIT_AUDIO          0x00000010
#define SDL_INIT_VIDEO          0x00000020
#define SDL_INIT_EVENTS         0x00004000
#define SDL_QuitSubSystem(s) NULL
#define HAVE_ITOA 1
#undef SDL_AUDIO_DRIVER_XAUDIO2
#undef SDL_AUDIO_DRIVER_WINMM
#undef SDL_AUDIO_DRIVER_DUMMY
#undef SDL_AUDIO_DRIVER_DISK
#undef SDL_VIDEO_DRIVER_DUMMY
#undef SDL_VIDEO_RENDER_OGL_ES2
#undef SDL_VIDEO_OPENGL_ES2
#undef SDL_VIDEO_OPENGL_EGL
#undef SDL_FILESYSTEM_WINDOWS
#undef SDL_FILESYSTEM_COCOA
#undef SDL_FILESYSTEM_DUMMY
#undef SDL_FILESYSTEM_UNIX
#undef SDL_HAPTIC_DINPUT
#undef SDL_JOYSTICK_WINMM
#undef SDL_HAPTIC_IOKIT
#define SDL_DISABLE_WINDOWS_IME 1
#define SDL_DISABLE_SCANCODENAMES 1

#define _SDL_H
#define _SDL_error_h
#define _SDL_rwops_h
#define _SDL_hints_h
#define _SDL_assert_h
#define _SDL_main_h
#define _SDL_render_h
#define _SDL_gesture_c_h
#define _SDL_stdinc_h
static SDL_INLINE int SDL_SetError(const char *errstr, ...) { (void)errstr; return 1; }
#define SDL_assert(a)
#define SDL_Error(e)
#define SDL_ASSERT_LEVEL 0
#define SDL_ClearError()
static SDL_INLINE int SDL_OutOfMemory() { return 1; }
#define SDL_Unsupported() 1
#define SDL_InvalidParamError(p) 1
#define SDL_arraysize(array) (sizeof(array)/sizeof(array[0]))
#define SDL_RWops void
#define SDL_RWFromMem(b,l) NULL
#define SDL_RWread(ctx, ptr, size, n) 0
#define SDL_RWwrite(ctx, ptr, size, n) 0
#define SDL_RWclose(ctx) 0
#define SDL_WriteLE16(a, b) 0
#define SDL_WriteLE32(a, b) 0

#define SDL_GestureAddTouch(t) NULL
#define SDL_GestureProcessEvent(e) NULL

#define SDL_GetHint(n) NULL
#define SDL_AddHintCallback(n, f, x) NULL
#define SDL_DelHintCallback(n, f, x) NULL
#undef HAVE_M_PI
#include <stdlib.h>
#define HAVE_GETENV 1
#undef getenv
#define getenv(env) NULL
#define HAVE_STRDUP 1
#define HAVE_SNPRINTF 1
#include <stdio.h>
#ifndef snprintf
#define snprintf _snprintf
#endif

#define SDL_Renderer void
#define SDL_Texture void
typedef struct SDL_RendererInfo { const char* name; int num_texture_formats; int *texture_formats; } SDL_RendererInfo;
#define SDL_GetNumRenderDrivers() 0
#define SDL_GetRenderDriverInfo(i, info) { (info)->name = NULL; (info)->num_texture_formats = 0; }
#define SDL_CreateRenderer(a,b,c) NULL
#define SDL_DestroyRenderer(a)
#define SDL_DestroyTexture(a)
#define SDL_GetRendererInfo(a, b) NULL
#define SDL_TEXTUREACCESS_STREAMING 0
#define SDL_RenderSetViewport(a,b)
#define SDL_UpdateTexture(a,b,c,d) 0
#define SDL_RenderCopy(a,b,c,d) 0
#define SDL_RenderPresent(a)
#define SDL_CreateTexture(a, b, c, d, e) NULL

#define SDL_malloc(s) malloc(s)
#define SDL_calloc(n,s) calloc(n,s)
#define SDL_realloc(m,s) realloc(m,s)
#define SDL_free(m) free(m)
#define SDL_getenv(e) NULL
#define SDL_qsort(a,b,c,d) NULL
#define SDL_abs(v) abs(v)

#define SDL_iconv_utf8_locale(S) strdup(S)
#define SDL_iconv_string(t,f,S,l) strdup(S)

#ifdef __WIN32__
#define _INCLUDED_WINDOWS_H
#define WIN32_LEAN_AND_MEAN
#define STRICT 1
#define UNICODE 1
#undef _WIN32_WINNT
#define _WIN32_WINNT 0x501
#include <windows.h>
#undef CreateWindow
#ifdef __WINRT__
#define WIN_CoInitialize() S_OK
#define WIN_CoUninitialize() NULL
#else
#define WIN_CoInitialize() S_OK;{HRESULT hr=CoInitializeEx(NULL,COINIT_APARTMENTTHREADED);if(hr==RPC_E_CHANGED_MODE)hr=CoInitializeEx(NULL,COINIT_MULTITHREADED);}
#define WIN_CoUninitialize() {CoUninitialize();}
#endif

#define WIN_SetError(e) -1
#define CreateWindow(a, b, c, d, e, f, g, h, i, j, k) CreateWindowW(a, b, c, d, e, f, g, h, i, j, k)
#endif

#ifndef _SDL_stdinc_h_ZL
#define _SDL_stdinc_h_ZL

#ifdef HAVE_SYS_TYPES_H
#include <sys/types.h>
#endif
#ifdef HAVE_STDIO_H
#include <stdio.h>
#endif
#if defined(STDC_HEADERS)
# include <stdlib.h>
# include <stddef.h>
# include <stdarg.h>
#else
# if defined(HAVE_STDLIB_H)
#  include <stdlib.h>
# elif defined(HAVE_MALLOC_H)
#  include <malloc.h>
# endif
# if defined(HAVE_STDDEF_H)
#  include <stddef.h>
# endif
# if defined(HAVE_STDARG_H)
#  include <stdarg.h>
# endif
#endif
#ifdef HAVE_STRING_H
# if !defined(STDC_HEADERS) && defined(HAVE_MEMORY_H)
#  include <memory.h>
# endif
# include <string.h>
#endif
#ifdef HAVE_STRINGS_H
# include <strings.h>
#endif
#if defined(HAVE_INTTYPES_H)
# include <inttypes.h>
#elif defined(HAVE_STDINT_H)
# include <stdint.h>
#endif
#ifdef HAVE_CTYPE_H
# include <ctype.h>
#endif
#ifdef HAVE_MATH_H
# if defined(__WINRT__)

#  define _USE_MATH_DEFINES
# endif
# include <math.h>
#endif
#ifdef HAVE_FLOAT_H
# include <float.h>
#endif
#if defined(HAVE_ICONV) && defined(HAVE_ICONV_H)
# include <iconv.h>
#endif

#define SDL_arraysize(array)    (sizeof(array)/sizeof(array[0]))
#define SDL_TABLESIZE(table)    SDL_arraysize(table)

#ifdef __cplusplus
#define SDL_reinterpret_cast(type, expression) reinterpret_cast<type>(expression)
#define SDL_static_cast(type, expression) static_cast<type>(expression)
#define SDL_const_cast(type, expression) const_cast<type>(expression)
#else
#define SDL_reinterpret_cast(type, expression) ((type)(expression))
#define SDL_static_cast(type, expression) ((type)(expression))
#define SDL_const_cast(type, expression) ((type)(expression))
#endif

#define SDL_FOURCC(A, B, C, D) \
    ((SDL_static_cast(Uint32, SDL_static_cast(Uint8, (A))) << 0) | \
     (SDL_static_cast(Uint32, SDL_static_cast(Uint8, (B))) << 8) | \
     (SDL_static_cast(Uint32, SDL_static_cast(Uint8, (C))) << 16) | \
     (SDL_static_cast(Uint32, SDL_static_cast(Uint8, (D))) << 24))

typedef enum
{
    SDL_FALSE = 0,
    SDL_TRUE = 1
} SDL_bool;

typedef int8_t Sint8;

typedef uint8_t Uint8;

typedef int16_t Sint16;

typedef uint16_t Uint16;

typedef int32_t Sint32;

typedef uint32_t Uint32;

typedef int64_t Sint64;

typedef uint64_t Uint64;

#define SDL_COMPILE_TIME_ASSERT(name, x)               \
       typedef int SDL_dummy_ ## name[(x) * 2 - 1]

#ifndef DOXYGEN_SHOULD_IGNORE_THIS
SDL_COMPILE_TIME_ASSERT(uint8, sizeof(Uint8) == 1);
SDL_COMPILE_TIME_ASSERT(sint8, sizeof(Sint8) == 1);
SDL_COMPILE_TIME_ASSERT(uint16, sizeof(Uint16) == 2);
SDL_COMPILE_TIME_ASSERT(sint16, sizeof(Sint16) == 2);
SDL_COMPILE_TIME_ASSERT(uint32, sizeof(Uint32) == 4);
SDL_COMPILE_TIME_ASSERT(sint32, sizeof(Sint32) == 4);
SDL_COMPILE_TIME_ASSERT(uint64, sizeof(Uint64) == 8);
SDL_COMPILE_TIME_ASSERT(sint64, sizeof(Sint64) == 8);
#endif

#ifndef DOXYGEN_SHOULD_IGNORE_THIS
#if !defined(__ANDROID__)

typedef enum
{
    DUMMY_ENUM_VALUE
} SDL_DUMMY_ENUM;

SDL_COMPILE_TIME_ASSERT(enum, sizeof(SDL_DUMMY_ENUM) == sizeof(int));
#endif
#endif

#ifdef _begin_code_h
#error Nested inclusion of begin_code.h
#endif
#define _begin_code_h

#ifndef SDL_DEPRECATED
#  if (__GNUC__ >= 4)
#    define SDL_DEPRECATED __attribute__((deprecated))
#  else
#    define SDL_DEPRECATED
#  endif
#endif

#ifndef DECLSPEC
# if defined(__WIN32__) || defined(__WINRT__)
#  ifdef __BORLANDC__
#   ifdef BUILD_SDL
#    define DECLSPEC
#   else
#    define DECLSPEC    __declspec(dllimport)
#   endif
#  else
#   define DECLSPEC __declspec(dllexport)
#  endif
# else
#  if defined(__GNUC__) && __GNUC__ >= 4
#   define DECLSPEC __attribute__ ((visibility("default")))
#  elif defined(__GNUC__) && __GNUC__ >= 2
#   define DECLSPEC __declspec(dllexport)
#  else
#   define DECLSPEC
#  endif
# endif
#endif

